In [1]:
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

%matplotlib inline

In [2]:
df_07 = pd.read_excel("2007.xlsx")
df_08 = pd.read_excel("2008.xlsx")
df_09 = pd.read_excel("2009.xlsx")
df_10 = pd.read_excel("2010.xlsx")
df_11 = pd.read_excel("2011.xlsx")
df_12 = pd.read_excel("2012.xlsx")
df_13 = pd.read_excel("2013.xlsx")
df_14 = pd.read_excel("2014.xlsx")
df_15 = pd.read_excel("2015.xlsx")
df_16 = pd.read_excel("2016.xlsx")
df_17 = pd.read_excel("2017.xlsx")
df_18 = pd.read_excel("2018.xlsx")
df_19 = pd.read_excel("2019.xlsx")
df_20 = pd.read_excel("2020.xlsx")
df_21 = pd.read_excel("2021.xlsx")
df_22 = pd.read_excel("2022.xlsx")
df_23 = pd.read_excel("2023.xlsx")

In [3]:
df_07.head(2)

,"Table. New Lawful Permanent Residents by State of Residence, County of Residence, Country of Birth, and Major Class of Admission: 2007",Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4
0,(Top 200 counties by size of admission only),NaN,NaN,NaN,NaN
1,('D' signifies data withheld to limit disclosure),NaN,NaN,NaN,NaN

In [4]:
df_07 = df_07.drop([0,1,2])

In [5]:
df_07 = df_07.rename(columns=df_07.iloc[0]).drop(df_07.index[0])

In [6]:
df_07['Year'] = 2007
df_07 = df_07.drop(df_07.index[0]).reset_index(drop=True)
df_07.rename(columns={df_07.columns[-1]: 'Year'}, inplace=True)

In [7]:
df_07.head(2)

,State of Residence,County of Residence,Country of Birth,Major Class of Admission,Admissions,Year
0,California,Los Angeles,Afghanistan,Immediate Relatives - Spouses,19,2007
1,California,Los Angeles,Afghanistan,Immediate Relatives - Parents,11,2007

In [8]:
df_08 = df_08.drop([0,1,2])

In [9]:
df_08 = df_08.rename(columns=df_08.iloc[0]).drop(df_08.index[0])

In [10]:
df_08['Year'] = 2008
df_08 = df_08.drop(df_08.index[0]).reset_index(drop=True)
df_08.rename(columns={df_08.columns[-1]: 'Year'}, inplace=True)

In [11]:
df_08.head(2)

,State of Residence,County of Residence,Country of Birth,Major Class of Admission,Admissions,Year
0,California,Los Angeles,Afghanistan,Other,15,2008
1,California,Los Angeles,Afghanistan,Immediate Relatives - Spouses,25,2008

In [12]:
df_09 = df_09.drop([0,1,2])

In [13]:
df_09 = df_09.rename(columns=df_09.iloc[0]).drop(df_09.index[0])

In [14]:
df_09['Year'] = 2009
df_09 = df_09.drop(df_09.index[0]).reset_index(drop=True)
df_09.rename(columns={df_09.columns[-1]: 'Year'}, inplace=True)

In [15]:
df_09.head(3)

,State of Residence,County of Residence,Country of Birth,Major Class of Admission,Admissions,Year
0,California,Los Angeles,Afghanistan,Other,15,2009
1,California,Los Angeles,Afghanistan,Immediate Relatives - Spouses,36,2009
2,California,Los Angeles,Afghanistan,Immediate Relatives - Children,4,2009

In [16]:
df_10 = df_10.drop([0,1,2])

In [17]:
df_10 = df_10.rename(columns=df_10.iloc[0]).drop(df_10.index[0])

In [18]:
df_10['Year'] = 2010
df_10 = df_10.drop(df_10.index[0]).reset_index(drop=True)
df_10.rename(columns={df_10.columns[-1]: 'Year'}, inplace=True)

In [19]:
df_10

,State of Residence,County of Residence,Country of Birth,Major Class of Admission,Admissions,Year
0,California,Los Angeles,Afghanistan,Other,4,2010
1,California,Los Angeles,Afghanistan,Immediate Relatives - Spouses,29,2010
2,California,Los Angeles,Afghanistan,Immediate Relatives - Parents,9,2010
3,California,Los Angeles,Afghanistan,Family Preference 4th,D,2010
4,California,Los Angeles,Afghanistan,Family Preference 3rd,4,2010
...,...,...,...,...,...,...
80286,Florida,Volusia,Vietnam,Immediate Relatives - Spouses,5,2010
80287,Florida,Volusia,Vietnam,Immediate Relatives - Parents,6,2010
80288,Florida,Volusia,Vietnam,Family Preference 4th,D,2010
80289,Florida,Volusia,Vietnam,Family Preference 2nd,5,2010
80290,Florida,Volusia,Zambia,Employment Preference 3rd Skilled,D,2010

In [20]:
df_11 = df_11.drop([0,1,2])

In [21]:
df_11= df_11.rename(columns=df_11.iloc[0]).drop(df_11.index[0])

In [22]:
df_11['Year'] = 2011
df_11 = df_11.drop(df_11.index[0]).reset_index(drop=True)
df_11.rename(columns={df_11.columns[-1]: 'Year'}, inplace=True)

In [23]:
df_11

,State of Residence,County of Residence,Country of Birth,Major Class of Admission,Admissions,Year
0,California,Los Angeles,Afghanistan,Other,4,2011
1,California,Los Angeles,Afghanistan,Immediate Relatives - Spouses,20,2011
2,California,Los Angeles,Afghanistan,Immediate Relatives - Children,D,2011
3,California,Los Angeles,Afghanistan,Immediate Relatives - Parents,D,2011
4,California,Los Angeles,Afghanistan,Family Preference 3rd,5,2011
...,...,...,...,...,...,...
79354,New York,Oneida,Vietnam,Immediate Relatives - Children,D,2011
79355,New York,Oneida,Vietnam,Immediate Relatives - Parents,D,2011
79356,New York,Oneida,Vietnam,Family Preference 2nd,5,2011
79357,New York,Oneida,Yemen,Immediate Relatives - Spouses,D,2011
79358,New York,Oneida,Yemen,Immediate Relatives - Children,6,2011

In [24]:
df_12 = df_12.drop([0,1,2])

In [25]:
df_12= df_12.rename(columns=df_12.iloc[0]).drop(df_12.index[0])

In [26]:
df_12['Year'] = 2012
df_12 = df_12.drop(df_12.index[0]).reset_index(drop=True)
df_12.rename(columns={df_12.columns[-1]: 'Year'}, inplace=True)

In [27]:
df_12.head(3)

,State of Residence,County of Residence,Country of Birth,Major Class of Admission,Admissions,Year
0,California,Los Angeles,Afghanistan,Other,7,2012
1,California,Los Angeles,Afghanistan,Immediate Relatives - Spouses,21,2012
2,California,Los Angeles,Afghanistan,Immediate Relatives - Parents,15,2012

In [28]:
df_13 = df_13.drop([0,1,2])

In [29]:
df_13= df_13.rename(columns=df_13.iloc[0]).drop(df_13.index[0])

In [30]:
df_13['Year'] = 2013
df_13 = df_13.drop(df_13.index[0]).reset_index(drop=True)
df_13.rename(columns={df_13.columns[-1]: 'Year'}, inplace=True)

In [31]:
df_13.head(3)

,State of Residence,County of Residence,Country of Birth,Major Class of Admission,Admissions,Year
0,California,Los Angeles,Afghanistan,Other,10,2013
1,California,Los Angeles,Afghanistan,Immediate Relatives - Spouses,20,2013
2,California,Los Angeles,Afghanistan,Immediate Relatives - Children,D,2013

In [32]:
df_14 = df_14.drop([0,1,2])

In [33]:
df_14= df_14.rename(columns=df_14.iloc[0]).drop(df_14.index[0])

In [34]:
df_14['Year'] = 2014
df_14 = df_14.drop(df_14.index[0]).reset_index(drop=True)
df_14.rename(columns={df_14.columns[-1]: 'Year'}, inplace=True)

In [35]:
df_14.head(3)

,State of Residence,County of Residence,Country of Birth,Major Class of Admission,Admissions,Year
0,California,Los Angeles,Afghanistan,Other,182,2014
1,California,Los Angeles,Afghanistan,Immediate Relatives - Spouses,18,2014
2,California,Los Angeles,Afghanistan,Immediate Relatives - Children,4,2014

In [36]:
df_15 = df_15.drop([0,1,2])

In [37]:
df_15= df_15.rename(columns=df_15.iloc[0]).drop(df_15.index[0])

In [38]:
df_15['Year'] = 2015
df_15 = df_15.drop(df_15.index[0]).reset_index(drop=True)
df_15.rename(columns={df_15.columns[-1]: 'Year'}, inplace=True)

In [39]:
df_15.head(3)

,State of Residence,County of Residence,Country of Birth,Major Class of Admission,Admissions,Year
0,California,Los Angeles,Afghanistan,Other,132,2015
1,California,Los Angeles,Afghanistan,Immediate Relatives - Spouses,23,2015
2,California,Los Angeles,Afghanistan,Immediate Relatives - Children,D,2015

In [40]:
df_16 = df_16.drop([0,1,2])

In [41]:
df_16= df_16.rename(columns=df_16.iloc[0]).drop(df_16.index[0])

In [42]:
df_16['Year'] = 2016
df_16 = df_16.drop(df_16.index[0]).reset_index(drop=True)
df_16.rename(columns={df_16.columns[-1]: 'Year'}, inplace=True)

In [43]:
df_16.head(3)

,State of Residence,County of Residence,Country of Birth,Major Class of Admission,Admissions,Year
0,California,Los Angeles,Afghanistan,Family Preference 2nd,19,2016
1,California,Los Angeles,Afghanistan,Family Preference 3rd,D,2016
2,California,Los Angeles,Afghanistan,Immediate Relatives - Spouses,16,2016

In [44]:
df_17 = df_17.drop([0,1,2])

In [45]:
df_17= df_17.rename(columns=df_17.iloc[0]).drop(df_17.index[0])

In [46]:
df_17['Year'] = 2017
df_17 = df_17.drop(df_17.index[0]).reset_index(drop=True)
df_17.rename(columns={df_17.columns[-1]: 'Year'}, inplace=True)

In [47]:
df_17.head(3)

,State of Residence,County of Residence,Country of Birth,Major Class of Admission,Admissions,Year
0,California,Los Angeles,Afghanistan,Other,408,2017
1,California,Los Angeles,Afghanistan,Immediate Relatives - Spouses,13,2017
2,California,Los Angeles,Afghanistan,Immediate Relatives - Children,D,2017

In [48]:
df_18 = df_18.drop([0,1,2])

In [49]:
df_18= df_18.rename(columns=df_18.iloc[0]).drop(df_18.index[0])

In [50]:
df_18['Year'] = 2018
df_18 = df_18.drop(df_18.index[0]).reset_index(drop=True)
df_18.rename(columns={df_18.columns[-1]: 'Year'}, inplace=True)

In [51]:
df_18.head(3)

,State of Residence,County of Residence,Country of Birth,Major Class of Admission,Admissions,Year
0,California,Los Angeles,Afghanistan,Other,234,2018
1,California,Los Angeles,Afghanistan,Immediate Relatives - Spouses,6,2018
2,California,Los Angeles,Afghanistan,Immediate Relatives - Parents,6,2018

In [52]:
df_19 = df_19.drop([0,1,2])

In [53]:
df_19= df_19.rename(columns=df_19.iloc[0]).drop(df_19.index[0])

In [54]:
df_19['Year'] = 2019
df_19 = df_19.drop(df_19.index[0]).reset_index(drop=True)
df_19.rename(columns={df_19.columns[-1]: 'Year'}, inplace=True)

In [55]:
df_19.head(3)

,State of Residence,County of Residence,Country of Birth,Major Class of Admission,Admissions,Year
0,California,Los Angeles,Afghanistan,Family Preference 2nd,9,2019
1,California,Los Angeles,Afghanistan,Immediate Relatives - Parents,9,2019
2,California,Los Angeles,Afghanistan,Immediate Relatives - Children,D,2019

In [56]:
df_20 =df_20.rename(columns=df_20.iloc[1]).drop(df_20.index[:2])

In [57]:
df_20['Year'] = 2020
df_20 = df_20.reset_index(drop=True)
df_20.rename(columns={df_20.columns[-1]: 'Year'}, inplace=True)

In [58]:
df_20.head()

,State of Residence,County of Residence,Country of Birth,Major Class of Admission,Admissions,Year
0,Arizona,Maricopa,Afghanistan,Immediate Relatives - Spouses,D,2020
1,Arizona,Maricopa,Afghanistan,Immediate Relatives - Children,D,2020
2,Arizona,Maricopa,Afghanistan,Immediate Relatives - Parents,D,2020
3,Arizona,Maricopa,Afghanistan,Family Preference 2nd,D,2020
4,Arizona,Maricopa,Afghanistan,Diversity Program,4,2020

In [59]:
df_21 =df_21.rename(columns=df_21.iloc[1]).drop(df_21.index[:2])

In [60]:
df_21['Year'] = 2021
df_21 = df_21.reset_index(drop=True)
df_21.rename(columns={df_21.columns[-1]: 'Year'}, inplace=True)

In [61]:
df_21.head()

,State of Residence,County of Residence,Country of Birth,Major Class of Admission,Admissions,Year
0,Alabama,Jefferson,Albania,Diversity Program,D,2021
1,Alabama,Jefferson,Algeria,Immediate Relatives - Spouses,D,2021
2,Alabama,Jefferson,Argentina,Immediate Relatives - Spouses,D,2021
3,Alabama,Jefferson,Argentina,Immediate Relatives - Children,D,2021
4,Alabama,Jefferson,Australia,Immediate Relatives - Spouses,4,2021

In [62]:
df_22 =df_22.rename(columns=df_22.iloc[1]).drop(df_22.index[:2])

In [63]:
df_22['Year'] = 2022
df_22 = df_22.reset_index(drop=True)
df_22.rename(columns={df_22.columns[-1]: 'Year'}, inplace=True)

In [64]:
df_22.head()

,State of Residence,County of Residence,Country of Birth,Major Class of Admission,Admissions,Year
0,Arizona,Maricopa,Afghanistan,Immediate Relatives - Spouses,10,2022
1,Arizona,Maricopa,Afghanistan,Immediate Relatives - Parents,D,2022
2,Arizona,Maricopa,Afghanistan,Family Preference 2nd,D,2022
3,Arizona,Maricopa,Afghanistan,Refugee and Asylee Adjustments,21,2022
4,Arizona,Maricopa,Afghanistan,Other,108,2022

In [65]:
df_23 =df_23.rename(columns=df_23.iloc[1]).drop(df_23.index[:2])

In [66]:
df_23['Year'] = 2023
df_23 = df_23.reset_index(drop=True)
df_23.rename(columns={df_23.columns[-1]: 'Year'}, inplace=True)

In [67]:
df_23.head()

,State of Residence,County of Residence,Country of Birth,Major Class of Admission,Admissions,Year
0,Arizona,Maricopa,Afghanistan,Immediate Relatives - Spouses,20,2023
1,Arizona,Maricopa,Afghanistan,Immediate Relatives - Children,0,2023
2,Arizona,Maricopa,Afghanistan,Immediate Relatives - Parents,10,2023
3,Arizona,Maricopa,Afghanistan,Family Preference 2nd,0,2023
4,Arizona,Maricopa,Afghanistan,Family Preference 3rd,0,2023

In [68]:
allfiles = [df_07, df_08, df_09, df_10, df_11, df_12, df_13, df_14, df_15, df_16, df_17, df_18, df_19, df_20, df_21, df_22, df_23]

In [69]:
master_df = pd.concat(allfiles, ignore_index =True)

In [87]:
sudan_df = master_df[(master_df['Country of Birth'] == 'Sudan') | (master_df['Country of Birth'] == 'South Sudan')].copy()

In [78]:
sudan_df

,State of Residence,County of Residence,Country of Birth,Major Class of Admission,Admissions,Year,Admissions_num,Admission_no
1113,California,Los Angeles,Sudan,Refugee and Asylee Adjustments,27,2007,NaN,27
1114,California,Los Angeles,Sudan,Immediate Relatives - Spouses,D,2007,0.0,D
1115,California,Los Angeles,Sudan,Immediate Relatives - Parents,D,2007,0.0,D
1116,California,Los Angeles,Sudan,Employment Preference 4th,D,2007,0.0,D
1117,California,Los Angeles,Sudan,Diversity Program,D,2007,0.0,D
...,...,...,...,...,...,...,...,...
1344443,Wisconsin,Milwaukee,Sudan,Family Preference 1st,0,2023,NaN,0
1344444,Wisconsin,Milwaukee,Sudan,Family Preference 2nd,0,2023,NaN,0
1344445,Wisconsin,Milwaukee,Sudan,Family Preference 4th,0,2023,NaN,0
1344446,Wisconsin,Milwaukee,Sudan,Diversity Program,10,2023,NaN,10
1344447,Wisconsin,Milwaukee,Sudan,Refugee and Asylee Adjustments,0,2023,NaN,0

In [89]:
sudan_df['Admission_no'] = sudan_df['Admissions'].astype(str).str.strip().str.replace(',', '')

In [90]:
sudan_df['Admission_no'] = pd.to_numeric(sudan_df['Admission_no'].replace('D',''), errors= 'coerce')

In [91]:
sudan_df['Admissions_1'] = pd.to_numeric(sudan_df['Admissions'].astype(str).str.strip().str.replace(',', '').replace('D', '1'), errors='coerce')

In [92]:
sudan_df

,State of Residence,County of Residence,Country of Birth,Major Class of Admission,Admissions,Year,Admission_no,Admissions_1
1113,California,Los Angeles,Sudan,Refugee and Asylee Adjustments,27,2007,27.0,27
1114,California,Los Angeles,Sudan,Immediate Relatives - Spouses,D,2007,NaN,1
1115,California,Los Angeles,Sudan,Immediate Relatives - Parents,D,2007,NaN,1
1116,California,Los Angeles,Sudan,Employment Preference 4th,D,2007,NaN,1
1117,California,Los Angeles,Sudan,Diversity Program,D,2007,NaN,1
...,...,...,...,...,...,...,...,...
1344443,Wisconsin,Milwaukee,Sudan,Family Preference 1st,0,2023,0.0,0
1344444,Wisconsin,Milwaukee,Sudan,Family Preference 2nd,0,2023,0.0,0
1344445,Wisconsin,Milwaukee,Sudan,Family Preference 4th,0,2023,0.0,0
1344446,Wisconsin,Milwaukee,Sudan,Diversity Program,10,2023,10.0,10
1344447,Wisconsin,Milwaukee,Sudan,Refugee and Asylee Adjustments,0,2023,0.0,0

In [95]:
total_0 = sudan_df.groupby('Year')['Admission_no'].sum()

In [97]:
total_1 = sudan_df.groupby('Year')['Admissions_1'].sum()

In [98]:
display(total_0)
display(total_1)

Year
2007    1870.0
2008    2316.0
2009    2299.0
2010    1461.0
2011    1665.0
2012    1523.0
2013    1079.0
2014    1508.0
2015    2366.0
2016    1997.0
2017    2440.0
2018    2470.0
2019    1761.0
2020    1091.0
2021     341.0
2022     673.0
2023    2000.0
Name: Admission_no, dtype: float64

Year
2007    2135
2008    2568
2009    2603
2010    1755
2011    1972
2012    1855
2013    1406
2014    1819
2015    2683
2016    2337
2017    2781
2018    2826
2019    2119
2020    1379
2021     592
2022     973
2023    2000
Name: Admissions_1, dtype: int64

Census DF

In [14]:
census21 = pd.read_csv("census1.csv")

In [17]:
census21.head(5)

,GEO_ID,NAME,B05006_001E,B05006_001M,B05006_002E,B05006_002M,B05006_003E,B05006_003M,B05006_004E,B05006_004M,...,B05006_164M,B05006_165E,B05006_165M,B05006_166E,B05006_166M,B05006_167E,B05006_167M,B05006_168E,B05006_168M,Unnamed: 338
0,Geography,Geographic Area Name,Estimate!!Total:,Margin of Error!!Total:,Estimate!!Total:!!Europe:,Margin of Error!!Total:!!Europe:,Estimate!!Total:!!Europe:!!Northern Europe:,Margin of Error!!Total:!!Europe:!!Northern Eur...,Estimate!!Total:!!Europe:!!Northern Europe:!!D...,Margin of Error!!Total:!!Europe:!!Northern Eur...,...,Margin of Error!!Total:!!Americas:!!Latin Amer...,Estimate!!Total:!!Americas:!!Latin America:!!S...,Margin of Error!!Total:!!Americas:!!Latin Amer...,Estimate!!Total:!!Americas:!!Northern America:,Margin of Error!!Total:!!Americas:!!Northern A...,Estimate!!Total:!!Americas:!!Northern America:...,Margin of Error!!Total:!!Americas:!!Northern A...,Estimate!!Total:!!Americas:!!Northern America:...,Margin of Error!!Total:!!Americas:!!Northern A...,NaN
1,0400000US01,Alabama,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,0400000US02,Alaska,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,0400000US04,Arizona,915934,17998,83048,5942,22003,2473,435,254,...,945,49,85,35934,3490,35462,3488,472,470,NaN
4,0400000US05,Arkansas,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [12]:
df1 = df1[(df1['Country of Birth'] == 'Sudan') | (df1['Country of Birth'] == 'South Sudan')]

KeyError: 'Country of Birth'

In [19]:
pd.read_csv("persons_of_concern.csv")

,Year,Country of Asylum,Country of Origin,Country of Asylum ISO,Country of Origin ISO,Refugees,Asylum-seekers,Other people in need of international protection,Stateless persons,Others of concern
0,2019,-,-,-,-,20414669,4148141,3582202,4217774,3857179
1,2020,-,-,-,-,20661846,4184926,3862102,4179331,3939756
2,2021,-,-,-,-,21327285,4616135,4406432,4338192,4223095
3,2022,-,-,-,-,29429078,5442319,5217456,4428314,6008804
4,2023,-,-,-,-,31637408,6858499,5755363,4358188,5945550
5,2024,-,-,-,-,30958200,8352712,5875359,4360087,3820662
6,2025,-,-,-,-,30490994,8414659,6064217,4431462,2426293

In [21]:
as_sudan = pd.read_csv("persons_of_concern_demographics.csv")

In [23]:
as_sudan2 = pd.read_csv("footnotes.csv")